using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace Examination_20200910
{
    class Program
    {
        static void Main(string[] args)
        {
//Показати історію замовлень певного користувача

//Показати історію замовлень певного користувача за певний період

//вивести всі замовлення за вчора

//вивести всі замовлення до Барселони

//вивести всі продукти американських виробників

//вивести всі адреси потужностей виробника конкретного товару

//Вивести всі країни виробників і без повторів.

//Вивести користувачів з максимальною сумою замовлення.

//Вивести емейл користувачів, що замовляли illegal продукти

//Вивести перелік замовлень, які необхідно доставити по адресах, які містять к - сть літер більше 1 в додатковому полі Коментар таблиці адреса

//Вивести перелік користувачів, які отримають продукти, термін придатності яких закінчиться 1.04.19

        }
    }
}
